MikroElektronika/core_packages/PIC/XC8/def/PIC12F752/mcu.h
extern volatile C2CON0bits_t C2CON0bits __at(0x09B);
// bitfield macros
#define _C2CON0_C2SYNC_POSN                                 0x0
#define _C2CON0_C2SYNC_POSITION                             0x0
#define _C2CON0_C2SYNC_SIZE                                 0x1
#define _C2CON0_C2SYNC_LENGTH                               0x1
#define _C2CON0_C2SYNC_MASK                                 0x1
#define _C2CON0_C2HYS_POSN                                  0x1
#define _C2CON0_C2HYS_POSITION                              0x1
#define _C2CON0_C2HYS_SIZE                                  0x1
#define _C2CON0_C2HYS_LENGTH                                0x1
#define _C2CON0_C2HYS_MASK                                  0x2
#define _C2CON0_C2SP_POSN                                   0x2
#define _C2CON0_C2SP_POSITION                               0x2
#define _C2CON0_C2SP_SIZE                                   0x1
#define _C2CON0_C2SP_LENGTH                                 0x1
#define _C2CON0_C2SP_MASK                                   0x4
#define _C2CON0_C2ZLF_POSN                                  0x3
#define _C2CON0_C2ZLF_POSITION                              0x3
#define _C2CON0_C2ZLF_SIZE                                  0x1
#define _C2CON0_C2ZLF_LENGTH                                0x1
#define _C2CON0_C2ZLF_MASK                                  0x8
#define _C2CON0_C2POL_POSN                                  0x4
#define _C2CON0_C2POL_POSITION                              0x4
#define _C2CON0_C2POL_SIZE                                  0x1
#define _C2CON0_C2POL_LENGTH                                0x1
#define _C2CON0_C2POL_MASK                                  0x10
#define _C2CON0_C2OE_POSN                                   0x5
#define _C2CON0_C2OE_POSITION                               0x5
#define _C2CON0_C2OE_SIZE                                   0x1
#define _C2CON0_C2OE_LENGTH                                 0x1
#define _C2CON0_C2OE_MASK                                   0x20
#define _C2CON0_C2OUT_POSN                                  0x6
#define _C2CON0_C2OUT_POSITION                              0x6
#define _C2CON0_C2OUT_SIZE                                  0x1
#define _C2CON0_C2OUT_LENGTH                                0x1
#define _C2CON0_C2OUT_MASK                                  0x40
#define _C2CON0_C2ON_POSN                                   0x7
#define _C2CON0_C2ON_POSITION                               0x7
#define _C2CON0_C2ON_SIZE                                   0x1
#define _C2CON0_C2ON_LENGTH                                 0x1
#define _C2CON0_C2ON_MASK                                   0x80

// Register: CM2CON1
#define CM2CON1 CM2CON1
extern volatile unsigned char           CM2CON1             __at(0x09C);
#ifndef _LIB_BUILD
asm("CM2CON1 equ 09Ch");
#endif
// aliases
extern volatile unsigned char           C2CON1              __at(0x09C);
#ifndef _LIB_BUILD
asm("C2CON1 equ 09Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C2NCH0                 :1;
        unsigned                        :3;
        unsigned C2PCH                  :2;
        unsigned C2INTN                 :1;
        unsigned C2INTP                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned C2PCH0                 :1;
        unsigned C2PCH1                 :1;
    };
} CM2CON1bits_t;
extern volatile CM2CON1bits_t CM2CON1bits __at(0x09C);
// bitfield macros
#define _CM2CON1_C2NCH0_POSN                                0x0
#define _CM2CON1_C2NCH0_POSITION                            0x0
#define _CM2CON1_C2NCH0_SIZE                                0x1
#define _CM2CON1_C2NCH0_LENGTH                              0x1
#define _CM2CON1_C2NCH0_MASK                                0x1
#define _CM2CON1_C2PCH_POSN                                 0x4
#define _CM2CON1_C2PCH_POSITION                             0x4
#define _CM2CON1_C2PCH_SIZE                                 0x2
#define _CM2CON1_C2PCH_LENGTH                               0x2
#define _CM2CON1_C2PCH_MASK                                 0x30
#define _CM2CON1_C2INTN_POSN                                0x6
#define _CM2CON1_C2INTN_POSITION                            0x6
#define _CM2CON1_C2INTN_SIZE                                0x1
#define _CM2CON1_C2INTN_LENGTH                              0x1
#define _CM2CON1_C2INTN_MASK                                0x40
#define _CM2CON1_C2INTP_POSN                                0x7
#define _CM2CON1_C2INTP_POSITION                            0x7
#define _CM2CON1_C2INTP_SIZE                                0x1
#define _CM2CON1_C2INTP_LENGTH                              0x1
#define _CM2CON1_C2INTP_MASK                                0x80
#define _CM2CON1_C2PCH0_POSN                                0x4
#define _CM2CON1_C2PCH0_POSITION                            0x4
#define _CM2CON1_C2PCH0_SIZE                                0x1
#define _CM2CON1_C2PCH0_LENGTH                              0x1
#define _CM2CON1_C2PCH0_MASK                                0x10
#define _CM2CON1_C2PCH1_POSN                                0x5
#define _CM2CON1_C2PCH1_POSITION                            0x5
#define _CM2CON1_C2PCH1_SIZE                                0x1
#define _CM2CON1_C2PCH1_LENGTH                              0x1
#define _CM2CON1_C2PCH1_MASK                                0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned C2NCH0                 :1;
        unsigned                        :3;
        unsigned C2PCH                  :2;
        unsigned C2INTN                 :1;
        unsigned C2INTP                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned C2PCH0                 :1;
        unsigned C2PCH1                 :1;
    };
} C2CON1bits_t;
extern volatile C2CON1bits_t C2CON1bits __at(0x09C);
// bitfield macros
#define _C2CON1_C2NCH0_POSN                                 0x0
#define _C2CON1_C2NCH0_POSITION                             0x0
#define _C2CON1_C2NCH0_SIZE                                 0x1
#define _C2CON1_C2NCH0_LENGTH                               0x1
#define _C2CON1_C2NCH0_MASK                                 0x1
#define _C2CON1_C2PCH_POSN                                  0x4
#define _C2CON1_C2PCH_POSITION                              0x4
#define _C2CON1_C2PCH_SIZE                                  0x2
#define _C2CON1_C2PCH_LENGTH                                0x2
#define _C2CON1_C2PCH_MASK                                  0x30
#define _C2CON1_C2INTN_POSN                                 0x6
#define _C2CON1_C2INTN_POSITION                             0x6
#define _C2CON1_C2INTN_SIZE                                 0x1
#define _C2CON1_C2INTN_LENGTH                               0x1
#define _C2CON1_C2INTN_MASK                                 0x40
#define _C2CON1_C2INTP_POSN                                 0x7
#define _C2CON1_C2INTP_POSITION                             0x7
#define _C2CON1_C2INTP_SIZE                                 0x1
#define _C2CON1_C2INTP_LENGTH                               0x1
#define _C2CON1_C2INTP_MASK                                 0x80
#define _C2CON1_C2PCH0_POSN                                 0x4
#define _C2CON1_C2PCH0_POSITION                             0x4
#define _C2CON1_C2PCH0_SIZE                                 0x1
#define _C2CON1_C2PCH0_LENGTH                               0x1
#define _C2CON1_C2PCH0_MASK                                 0x10
#define _C2CON1_C2PCH1_POSN                                 0x5
#define _C2CON1_C2PCH1_POSITION                             0x5
#define _C2CON1_C2PCH1_SIZE                                 0x1
#define _C2CON1_C2PCH1_LENGTH                               0x1
#define _C2CON1_C2PCH1_MASK                                 0x20

// Register: CM1CON0
#define CM1CON0 CM1CON0
extern volatile unsigned char           CM1CON0             __at(0x09D);
#ifndef _LIB_BUILD
asm("CM1CON0 equ 09Dh");
#endif
// aliases
extern volatile unsigned char           C1CON0              __at(0x09D);
#ifndef _LIB_BUILD
asm("C1CON0 equ 09Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1SYNC                 :1;
        unsigned C1HYS                  :1;
        unsigned C1SP                   :1;
        unsigned C1ZLF                  :1;
        unsigned C1POL                  :1;
        unsigned C1OE                   :1;
        unsigned C1OUT                  :1;
        unsigned C1ON                   :1;
    };
} CM1CON0bits_t;
extern volatile CM1CON0bits_t CM1CON0bits __at(0x09D);
// bitfield macros
#define _CM1CON0_C1SYNC_POSN                                0x0
#define _CM1CON0_C1SYNC_POSITION                            0x0
#define _CM1CON0_C1SYNC_SIZE                                0x1
#define _CM1CON0_C1SYNC_LENGTH                              0x1
#define _CM1CON0_C1SYNC_MASK                                0x1
#define _CM1CON0_C1HYS_POSN                                 0x1
#define _CM1CON0_C1HYS_POSITION                             0x1
#define _CM1CON0_C1HYS_SIZE                                 0x1
#define _CM1CON0_C1HYS_LENGTH                               0x1
#define _CM1CON0_C1HYS_MASK                                 0x2
#define _CM1CON0_C1SP_POSN                                  0x2
#define _CM1CON0_C1SP_POSITION                              0x2
#define _CM1CON0_C1SP_SIZE                                  0x1
#define _CM1CON0_C1SP_LENGTH                                0x1
#define _CM1CON0_C1SP_MASK                                  0x4
#define _CM1CON0_C1ZLF_POSN                                 0x3
#define _CM1CON0_C1ZLF_POSITION                             0x3
#define _CM1CON0_C1ZLF_SIZE                                 0x1
#define _CM1CON0_C1ZLF_LENGTH                               0x1
#define _CM1CON0_C1ZLF_MASK                                 0x8
#define _CM1CON0_C1POL_POSN                                 0x4
#define _CM1CON0_C1POL_POSITION                             0x4
#define _CM1CON0_C1POL_SIZE                                 0x1
#define _CM1CON0_C1POL_LENGTH                               0x1
#define _CM1CON0_C1POL_MASK                                 0x10
#define _CM1CON0_C1OE_POSN                                  0x5
#define _CM1CON0_C1OE_POSITION                              0x5
#define _CM1CON0_C1OE_SIZE                                  0x1
#define _CM1CON0_C1OE_LENGTH                                0x1
#define _CM1CON0_C1OE_MASK                                  0x20
#define _CM1CON0_C1OUT_POSN                                 0x6
#define _CM1CON0_C1OUT_POSITION                             0x6
#define _CM1CON0_C1OUT_SIZE                                 0x1
#define _CM1CON0_C1OUT_LENGTH                               0x1
#define _CM1CON0_C1OUT_MASK                                 0x40
#define _CM1CON0_C1ON_POSN                                  0x7
#define _CM1CON0_C1ON_POSITION                              0x7
#define _CM1CON0_C1ON_SIZE                                  0x1
#define _CM1CON0_C1ON_LENGTH                                0x1
#define _CM1CON0_C1ON_MASK                                  0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned C1SYNC                 :1;
        unsigned C1HYS                  :1;
        unsigned C1SP                   :1;
        unsigned C1ZLF                  :1;
        unsigned C1POL                  :1;
        unsigned C1OE                   :1;
        unsigned C1OUT                  :1;
        unsigned C1ON                   :1;
    };
} C1CON0bits_t;
extern volatile C1CON0bits_t C1CON0bits __at(0x09D);
// bitfield macros
#define _C1CON0_C1SYNC_POSN                                 0x0
#define _C1CON0_C1SYNC_POSITION                             0x0
#define _C1CON0_C1SYNC_SIZE                                 0x1
#define _C1CON0_C1SYNC_LENGTH                               0x1
#define _C1CON0_C1SYNC_MASK                                 0x1
#define _C1CON0_C1HYS_POSN                                  0x1
#define _C1CON0_C1HYS_POSITION                              0x1
#define _C1CON0_C1HYS_SIZE                                  0x1
#define _C1CON0_C1HYS_LENGTH                                0x1
#define _C1CON0_C1HYS_MASK                                  0x2
#define _C1CON0_C1SP_POSN                                   0x2
#define _C1CON0_C1SP_POSITION                               0x2
#define _C1CON0_C1SP_SIZE                                   0x1
#define _C1CON0_C1SP_LENGTH                                 0x1
#define _C1CON0_C1SP_MASK                                   0x4
#define _C1CON0_C1ZLF_POSN                                  0x3
#define _C1CON0_C1ZLF_POSITION                              0x3
#define _C1CON0_C1ZLF_SIZE                                  0x1
#define _C1CON0_C1ZLF_LENGTH                                0x1
#define _C1CON0_C1ZLF_MASK                                  0x8
#define _C1CON0_C1POL_POSN                                  0x4
#define _C1CON0_C1POL_POSITION                              0x4
#define _C1CON0_C1POL_SIZE                                  0x1
#define _C1CON0_C1POL_LENGTH                                0x1
#define _C1CON0_C1POL_MASK                                  0x10
#define _C1CON0_C1OE_POSN                                   0x5
#define _C1CON0_C1OE_POSITION                               0x5
#define _C1CON0_C1OE_SIZE                                   0x1
#define _C1CON0_C1OE_LENGTH                                 0x1
#define _C1CON0_C1OE_MASK                                   0x20
#define _C1CON0_C1OUT_POSN                                  0x6
#define _C1CON0_C1OUT_POSITION                              0x6
#define _C1CON0_C1OUT_SIZE                                  0x1
#define _C1CON0_C1OUT_LENGTH                                0x1
#define _C1CON0_C1OUT_MASK                                  0x40
#define _C1CON0_C1ON_POSN                                   0x7
#define _C1CON0_C1ON_POSITION                               0x7
#define _C1CON0_C1ON_SIZE                                   0x1
#define _C1CON0_C1ON_LENGTH                                 0x1
#define _C1CON0_C1ON_MASK                                   0x80

// Register: CM1CON1
#define CM1CON1 CM1CON1
extern volatile unsigned char           CM1CON1             __at(0x09E);
#ifndef _LIB_BUILD
asm("CM1CON1 equ 09Eh");
#endif
// aliases
extern volatile unsigned char           C1CON1              __at(0x09E);
#ifndef _LIB_BUILD
asm("C1CON1 equ 09Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1NCH0                 :1;
        unsigned                        :3;
        unsigned C1PCH                  :2;
        unsigned C1INTN                 :1;
        unsigned C1INTP                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned C1PCH0                 :1;
        unsigned C1PCH1                 :1;
    };
} CM1CON1bits_t;
extern volatile CM1CON1bits_t CM1CON1bits __at(0x09E);
// bitfield macros
#define _CM1CON1_C1NCH0_POSN                                0x0
#define _CM1CON1_C1NCH0_POSITION                            0x0
#define _CM1CON1_C1NCH0_SIZE                                0x1
#define _CM1CON1_C1NCH0_LENGTH                              0x1
#define _CM1CON1_C1NCH0_MASK                                0x1
#define _CM1CON1_C1PCH_POSN                                 0x4
#define _CM1CON1_C1PCH_POSITION                             0x4
#define _CM1CON1_C1PCH_SIZE                                 0x2
#define _CM1CON1_C1PCH_LENGTH                               0x2
#define _CM1CON1_C1PCH_MASK                                 0x30
#define _CM1CON1_C1INTN_POSN                                0x6
#define _CM1CON1_C1INTN_POSITION                            0x6
#define _CM1CON1_C1INTN_SIZE                                0x1
#define _CM1CON1_C1INTN_LENGTH                              0x1
#define _CM1CON1_C1INTN_MASK                                0x40
#define _CM1CON1_C1INTP_POSN                                0x7
#define _CM1CON1_C1INTP_POSITION                            0x7
#define _CM1CON1_C1INTP_SIZE                                0x1
#define _CM1CON1_C1INTP_LENGTH                              0x1
#define _CM1CON1_C1INTP_MASK                                0x80
#define _CM1CON1_C1PCH0_POSN                                0x4
#define _CM1CON1_C1PCH0_POSITION                            0x4
#define _CM1CON1_C1PCH0_SIZE                                0x1
#define _CM1CON1_C1PCH0_LENGTH                              0x1
#define _CM1CON1_C1PCH0_MASK                                0x10
#define _CM1CON1_C1PCH1_POSN                                0x5
#define _CM1CON1_C1PCH1_POSITION                            0x5
#define _CM1CON1_C1PCH1_SIZE                                0x1
#define _CM1CON1_C1PCH1_LENGTH                              0x1
#define _CM1CON1_C1PCH1_MASK                                0x20
// alias bitfield definitions
typedef union {
    struct {
        unsigned C1NCH0                 :1;
        unsigned                        :3;
        unsigned C1PCH                  :2;
        unsigned C1INTN                 :1;
        unsigned C1INTP                 :1;
    };
    struct {
        unsigned                        :4;
        unsigned C1PCH0                 :1;
        unsigned C1PCH1                 :1;
    };
} C1CON1bits_t;
