MikroElektronika/core_packages/PIC/XC8/def/PIC12F752/mcu.h
extern volatile T2CONbits_t T2CONbits __at(0x112);
// bitfield macros
#define _T2CON_T2CKPS_POSN                                  0x0
#define _T2CON_T2CKPS_POSITION                              0x0
#define _T2CON_T2CKPS_SIZE                                  0x2
#define _T2CON_T2CKPS_LENGTH                                0x2
#define _T2CON_T2CKPS_MASK                                  0x3
#define _T2CON_TMR2ON_POSN                                  0x2
#define _T2CON_TMR2ON_POSITION                              0x2
#define _T2CON_TMR2ON_SIZE                                  0x1
#define _T2CON_TMR2ON_LENGTH                                0x1
#define _T2CON_TMR2ON_MASK                                  0x4
#define _T2CON_T2OUTPS_POSN                                 0x3
#define _T2CON_T2OUTPS_POSITION                             0x3
#define _T2CON_T2OUTPS_SIZE                                 0x4
#define _T2CON_T2OUTPS_LENGTH                               0x4
#define _T2CON_T2OUTPS_MASK                                 0x78
#define _T2CON_T2CKPS0_POSN                                 0x0
#define _T2CON_T2CKPS0_POSITION                             0x0
#define _T2CON_T2CKPS0_SIZE                                 0x1
#define _T2CON_T2CKPS0_LENGTH                               0x1
#define _T2CON_T2CKPS0_MASK                                 0x1
#define _T2CON_T2CKPS1_POSN                                 0x1
#define _T2CON_T2CKPS1_POSITION                             0x1
#define _T2CON_T2CKPS1_SIZE                                 0x1
#define _T2CON_T2CKPS1_LENGTH                               0x1
#define _T2CON_T2CKPS1_MASK                                 0x2
#define _T2CON_T2OUTPS0_POSN                                0x3
#define _T2CON_T2OUTPS0_POSITION                            0x3
#define _T2CON_T2OUTPS0_SIZE                                0x1
#define _T2CON_T2OUTPS0_LENGTH                              0x1
#define _T2CON_T2OUTPS0_MASK                                0x8
#define _T2CON_T2OUTPS1_POSN                                0x4
#define _T2CON_T2OUTPS1_POSITION                            0x4
#define _T2CON_T2OUTPS1_SIZE                                0x1
#define _T2CON_T2OUTPS1_LENGTH                              0x1
#define _T2CON_T2OUTPS1_MASK                                0x10
#define _T2CON_T2OUTPS2_POSN                                0x5
#define _T2CON_T2OUTPS2_POSITION                            0x5
#define _T2CON_T2OUTPS2_SIZE                                0x1
#define _T2CON_T2OUTPS2_LENGTH                              0x1
#define _T2CON_T2OUTPS2_MASK                                0x20
#define _T2CON_T2OUTPS3_POSN                                0x6
#define _T2CON_T2OUTPS3_POSITION                            0x6
#define _T2CON_T2OUTPS3_SIZE                                0x1
#define _T2CON_T2OUTPS3_LENGTH                              0x1
#define _T2CON_T2OUTPS3_MASK                                0x40

// Register: HLTMR1
#define HLTMR1 HLTMR1
extern volatile unsigned char           HLTMR1              __at(0x113);
#ifndef _LIB_BUILD
asm("HLTMR1 equ 0113h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HLTMR1                 :8;
    };
} HLTMR1bits_t;
extern volatile HLTMR1bits_t HLTMR1bits __at(0x113);
// bitfield macros
#define _HLTMR1_HLTMR1_POSN                                 0x0
#define _HLTMR1_HLTMR1_POSITION                             0x0
#define _HLTMR1_HLTMR1_SIZE                                 0x8
#define _HLTMR1_HLTMR1_LENGTH                               0x8
#define _HLTMR1_HLTMR1_MASK                                 0xFF

// Register: HLTPR1
#define HLTPR1 HLTPR1
extern volatile unsigned char           HLTPR1              __at(0x114);
#ifndef _LIB_BUILD
asm("HLTPR1 equ 0114h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned HLTPR1                 :8;
    };
} HLTPR1bits_t;
extern volatile HLTPR1bits_t HLTPR1bits __at(0x114);
// bitfield macros
#define _HLTPR1_HLTPR1_POSN                                 0x0
#define _HLTPR1_HLTPR1_POSITION                             0x0
#define _HLTPR1_HLTPR1_SIZE                                 0x8
#define _HLTPR1_HLTPR1_LENGTH                               0x8
#define _HLTPR1_HLTPR1_MASK                                 0xFF

// Register: HLT1CON0
#define HLT1CON0 HLT1CON0
extern volatile unsigned char           HLT1CON0            __at(0x115);
#ifndef _LIB_BUILD
asm("HLT1CON0 equ 0115h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned H1CKPS                 :2;
        unsigned H1ON                   :1;
        unsigned H1OUTPS                :4;
    };
    struct {
        unsigned H1CKPS0                :1;
        unsigned H1CKPS1                :1;
        unsigned                        :1;
        unsigned H1OUTPS0               :1;
        unsigned H1OUTPS1               :1;
        unsigned H1OUTPS2               :1;
        unsigned H1OUTPS3               :1;
    };
} HLT1CON0bits_t;
extern volatile HLT1CON0bits_t HLT1CON0bits __at(0x115);
// bitfield macros
#define _HLT1CON0_H1CKPS_POSN                               0x0
#define _HLT1CON0_H1CKPS_POSITION                           0x0
#define _HLT1CON0_H1CKPS_SIZE                               0x2
#define _HLT1CON0_H1CKPS_LENGTH                             0x2
#define _HLT1CON0_H1CKPS_MASK                               0x3
#define _HLT1CON0_H1ON_POSN                                 0x2
#define _HLT1CON0_H1ON_POSITION                             0x2
#define _HLT1CON0_H1ON_SIZE                                 0x1
#define _HLT1CON0_H1ON_LENGTH                               0x1
#define _HLT1CON0_H1ON_MASK                                 0x4
#define _HLT1CON0_H1OUTPS_POSN                              0x3
#define _HLT1CON0_H1OUTPS_POSITION                          0x3
#define _HLT1CON0_H1OUTPS_SIZE                              0x4
#define _HLT1CON0_H1OUTPS_LENGTH                            0x4
#define _HLT1CON0_H1OUTPS_MASK                              0x78
#define _HLT1CON0_H1CKPS0_POSN                              0x0
#define _HLT1CON0_H1CKPS0_POSITION                          0x0
#define _HLT1CON0_H1CKPS0_SIZE                              0x1
#define _HLT1CON0_H1CKPS0_LENGTH                            0x1
#define _HLT1CON0_H1CKPS0_MASK                              0x1
#define _HLT1CON0_H1CKPS1_POSN                              0x1
#define _HLT1CON0_H1CKPS1_POSITION                          0x1
#define _HLT1CON0_H1CKPS1_SIZE                              0x1
#define _HLT1CON0_H1CKPS1_LENGTH                            0x1
#define _HLT1CON0_H1CKPS1_MASK                              0x2
#define _HLT1CON0_H1OUTPS0_POSN                             0x3
#define _HLT1CON0_H1OUTPS0_POSITION                         0x3
#define _HLT1CON0_H1OUTPS0_SIZE                             0x1
#define _HLT1CON0_H1OUTPS0_LENGTH                           0x1
#define _HLT1CON0_H1OUTPS0_MASK                             0x8
#define _HLT1CON0_H1OUTPS1_POSN                             0x4
#define _HLT1CON0_H1OUTPS1_POSITION                         0x4
#define _HLT1CON0_H1OUTPS1_SIZE                             0x1
#define _HLT1CON0_H1OUTPS1_LENGTH                           0x1
#define _HLT1CON0_H1OUTPS1_MASK                             0x10
#define _HLT1CON0_H1OUTPS2_POSN                             0x5
#define _HLT1CON0_H1OUTPS2_POSITION                         0x5
#define _HLT1CON0_H1OUTPS2_SIZE                             0x1
#define _HLT1CON0_H1OUTPS2_LENGTH                           0x1
#define _HLT1CON0_H1OUTPS2_MASK                             0x20
#define _HLT1CON0_H1OUTPS3_POSN                             0x6
#define _HLT1CON0_H1OUTPS3_POSITION                         0x6
#define _HLT1CON0_H1OUTPS3_SIZE                             0x1
#define _HLT1CON0_H1OUTPS3_LENGTH                           0x1
#define _HLT1CON0_H1OUTPS3_MASK                             0x40

// Register: HLT1CON1
#define HLT1CON1 HLT1CON1
extern volatile unsigned char           HLT1CON1            __at(0x116);
#ifndef _LIB_BUILD
asm("HLT1CON1 equ 0116h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned H1REREN                :1;
        unsigned H1FEREN                :1;
        unsigned H1ERS                  :3;
    };
    struct {
        unsigned                        :2;
        unsigned H1ERS0                 :1;
        unsigned H1ERS1                 :1;
        unsigned H1ERS2                 :1;
    };
} HLT1CON1bits_t;
