MikroElektronika/core_packages/PIC/XC8/def/PIC12F752/mcu.h
extern volatile HLT1CON1bits_t HLT1CON1bits __at(0x116);
// bitfield macros
#define _HLT1CON1_H1REREN_POSN                              0x0
#define _HLT1CON1_H1REREN_POSITION                          0x0
#define _HLT1CON1_H1REREN_SIZE                              0x1
#define _HLT1CON1_H1REREN_LENGTH                            0x1
#define _HLT1CON1_H1REREN_MASK                              0x1
#define _HLT1CON1_H1FEREN_POSN                              0x1
#define _HLT1CON1_H1FEREN_POSITION                          0x1
#define _HLT1CON1_H1FEREN_SIZE                              0x1
#define _HLT1CON1_H1FEREN_LENGTH                            0x1
#define _HLT1CON1_H1FEREN_MASK                              0x2
#define _HLT1CON1_H1ERS_POSN                                0x2
#define _HLT1CON1_H1ERS_POSITION                            0x2
#define _HLT1CON1_H1ERS_SIZE                                0x3
#define _HLT1CON1_H1ERS_LENGTH                              0x3
#define _HLT1CON1_H1ERS_MASK                                0x1C
#define _HLT1CON1_H1ERS0_POSN                               0x2
#define _HLT1CON1_H1ERS0_POSITION                           0x2
#define _HLT1CON1_H1ERS0_SIZE                               0x1
#define _HLT1CON1_H1ERS0_LENGTH                             0x1
#define _HLT1CON1_H1ERS0_MASK                               0x4
#define _HLT1CON1_H1ERS1_POSN                               0x3
#define _HLT1CON1_H1ERS1_POSITION                           0x3
#define _HLT1CON1_H1ERS1_SIZE                               0x1
#define _HLT1CON1_H1ERS1_LENGTH                             0x1
#define _HLT1CON1_H1ERS1_MASK                               0x8
#define _HLT1CON1_H1ERS2_POSN                               0x4
#define _HLT1CON1_H1ERS2_POSITION                           0x4
#define _HLT1CON1_H1ERS2_SIZE                               0x1
#define _HLT1CON1_H1ERS2_LENGTH                             0x1
#define _HLT1CON1_H1ERS2_MASK                               0x10

// Register: ANSELA
#define ANSELA ANSELA
extern volatile unsigned char           ANSELA              __at(0x185);
#ifndef _LIB_BUILD
asm("ANSELA equ 0185h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSA0                  :1;
        unsigned ANSA1                  :1;
        unsigned ANSA2                  :1;
        unsigned                        :1;
        unsigned ANSA4                  :1;
        unsigned ANSA5                  :1;
    };
} ANSELAbits_t;
extern volatile ANSELAbits_t ANSELAbits __at(0x185);
// bitfield macros
#define _ANSELA_ANSA0_POSN                                  0x0
#define _ANSELA_ANSA0_POSITION                              0x0
#define _ANSELA_ANSA0_SIZE                                  0x1
#define _ANSELA_ANSA0_LENGTH                                0x1
#define _ANSELA_ANSA0_MASK                                  0x1
#define _ANSELA_ANSA1_POSN                                  0x1
#define _ANSELA_ANSA1_POSITION                              0x1
#define _ANSELA_ANSA1_SIZE                                  0x1
#define _ANSELA_ANSA1_LENGTH                                0x1
#define _ANSELA_ANSA1_MASK                                  0x2
#define _ANSELA_ANSA2_POSN                                  0x2
#define _ANSELA_ANSA2_POSITION                              0x2
#define _ANSELA_ANSA2_SIZE                                  0x1
#define _ANSELA_ANSA2_LENGTH                                0x1
#define _ANSELA_ANSA2_MASK                                  0x4
#define _ANSELA_ANSA4_POSN                                  0x4
#define _ANSELA_ANSA4_POSITION                              0x4
#define _ANSELA_ANSA4_SIZE                                  0x1
#define _ANSELA_ANSA4_LENGTH                                0x1
#define _ANSELA_ANSA4_MASK                                  0x10
#define _ANSELA_ANSA5_POSN                                  0x5
#define _ANSELA_ANSA5_POSITION                              0x5
#define _ANSELA_ANSA5_SIZE                                  0x1
#define _ANSELA_ANSA5_LENGTH                                0x1
#define _ANSELA_ANSA5_MASK                                  0x20

// Register: APFCON
#define APFCON APFCON
extern volatile unsigned char           APFCON              __at(0x188);
#ifndef _LIB_BUILD
asm("APFCON equ 0188h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned COG1O0SEL              :1;
        unsigned COG1O1SEL              :1;
        unsigned COG1FSEL               :1;
        unsigned                        :1;
        unsigned T1GSEL                 :1;
    };
} APFCONbits_t;
extern volatile APFCONbits_t APFCONbits __at(0x188);
// bitfield macros
#define _APFCON_COG1O0SEL_POSN                              0x0
#define _APFCON_COG1O0SEL_POSITION                          0x0
#define _APFCON_COG1O0SEL_SIZE                              0x1
#define _APFCON_COG1O0SEL_LENGTH                            0x1
#define _APFCON_COG1O0SEL_MASK                              0x1
#define _APFCON_COG1O1SEL_POSN                              0x1
#define _APFCON_COG1O1SEL_POSITION                          0x1
#define _APFCON_COG1O1SEL_SIZE                              0x1
#define _APFCON_COG1O1SEL_LENGTH                            0x1
#define _APFCON_COG1O1SEL_MASK                              0x2
#define _APFCON_COG1FSEL_POSN                               0x2
#define _APFCON_COG1FSEL_POSITION                           0x2
#define _APFCON_COG1FSEL_SIZE                               0x1
#define _APFCON_COG1FSEL_LENGTH                             0x1
#define _APFCON_COG1FSEL_MASK                               0x4
#define _APFCON_T1GSEL_POSN                                 0x4
#define _APFCON_T1GSEL_POSITION                             0x4
#define _APFCON_T1GSEL_SIZE                                 0x1
#define _APFCON_T1GSEL_LENGTH                               0x1
#define _APFCON_T1GSEL_MASK                                 0x10

// Register: OSCTUNE
#define OSCTUNE OSCTUNE
extern volatile unsigned char           OSCTUNE             __at(0x189);
#ifndef _LIB_BUILD
asm("OSCTUNE equ 0189h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TUN                    :5;
    };
    struct {
        unsigned TUN0                   :1;
        unsigned TUN1                   :1;
        unsigned TUN2                   :1;
        unsigned TUN3                   :1;
        unsigned TUN4                   :1;
    };
} OSCTUNEbits_t;
