MikroElektronika/core_packages/PIC/XC8/def/PIC12F752/mcu.h
extern volatile COG1CON1bits_t COG1CON1bits __at(0x196);
// bitfield macros
#define _COG1CON1_G1RS_POSN                                 0x0
#define _COG1CON1_G1RS_POSITION                             0x0
#define _COG1CON1_G1RS_SIZE                                 0x3
#define _COG1CON1_G1RS_LENGTH                               0x3
#define _COG1CON1_G1RS_MASK                                 0x7
#define _COG1CON1_G1FS_POSN                                 0x3
#define _COG1CON1_G1FS_POSITION                             0x3
#define _COG1CON1_G1FS_SIZE                                 0x3
#define _COG1CON1_G1FS_LENGTH                               0x3
#define _COG1CON1_G1FS_MASK                                 0x38
#define _COG1CON1_G1RSIM_POSN                               0x6
#define _COG1CON1_G1RSIM_POSITION                           0x6
#define _COG1CON1_G1RSIM_SIZE                               0x1
#define _COG1CON1_G1RSIM_LENGTH                             0x1
#define _COG1CON1_G1RSIM_MASK                               0x40
#define _COG1CON1_G1FSIM_POSN                               0x7
#define _COG1CON1_G1FSIM_POSITION                           0x7
#define _COG1CON1_G1FSIM_SIZE                               0x1
#define _COG1CON1_G1FSIM_LENGTH                             0x1
#define _COG1CON1_G1FSIM_MASK                               0x80
#define _COG1CON1_G1RS0_POSN                                0x0
#define _COG1CON1_G1RS0_POSITION                            0x0
#define _COG1CON1_G1RS0_SIZE                                0x1
#define _COG1CON1_G1RS0_LENGTH                              0x1
#define _COG1CON1_G1RS0_MASK                                0x1
#define _COG1CON1_G1RS1_POSN                                0x1
#define _COG1CON1_G1RS1_POSITION                            0x1
#define _COG1CON1_G1RS1_SIZE                                0x1
#define _COG1CON1_G1RS1_LENGTH                              0x1
#define _COG1CON1_G1RS1_MASK                                0x2
#define _COG1CON1_G1RS2_POSN                                0x2
#define _COG1CON1_G1RS2_POSITION                            0x2
#define _COG1CON1_G1RS2_SIZE                                0x1
#define _COG1CON1_G1RS2_LENGTH                              0x1
#define _COG1CON1_G1RS2_MASK                                0x4
#define _COG1CON1_G1FS0_POSN                                0x3
#define _COG1CON1_G1FS0_POSITION                            0x3
#define _COG1CON1_G1FS0_SIZE                                0x1
#define _COG1CON1_G1FS0_LENGTH                              0x1
#define _COG1CON1_G1FS0_MASK                                0x8
#define _COG1CON1_G1FS1_POSN                                0x4
#define _COG1CON1_G1FS1_POSITION                            0x4
#define _COG1CON1_G1FS1_SIZE                                0x1
#define _COG1CON1_G1FS1_LENGTH                              0x1
#define _COG1CON1_G1FS1_MASK                                0x10
#define _COG1CON1_G1FS2_POSN                                0x5
#define _COG1CON1_G1FS2_POSITION                            0x5
#define _COG1CON1_G1FS2_SIZE                                0x1
#define _COG1CON1_G1FS2_LENGTH                              0x1
#define _COG1CON1_G1FS2_MASK                                0x20

// Register: COG1ASD
#define COG1ASD COG1ASD
extern volatile unsigned char           COG1ASD             __at(0x197);
#ifndef _LIB_BUILD
asm("COG1ASD equ 0197h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned G1ASDSFLT              :1;
        unsigned G1ASDSC1               :1;
        unsigned G1ASDSC2               :1;
        unsigned G1ASDSHLT              :1;
        unsigned G1ASDL0                :1;
        unsigned G1ASDL1                :1;
        unsigned G1ARSEN                :1;
        unsigned G1ASDE                 :1;
    };
} COG1ASDbits_t;
extern volatile COG1ASDbits_t COG1ASDbits __at(0x197);
// bitfield macros
#define _COG1ASD_G1ASDSFLT_POSN                             0x0
#define _COG1ASD_G1ASDSFLT_POSITION                         0x0
#define _COG1ASD_G1ASDSFLT_SIZE                             0x1
#define _COG1ASD_G1ASDSFLT_LENGTH                           0x1
#define _COG1ASD_G1ASDSFLT_MASK                             0x1
#define _COG1ASD_G1ASDSC1_POSN                              0x1
#define _COG1ASD_G1ASDSC1_POSITION                          0x1
#define _COG1ASD_G1ASDSC1_SIZE                              0x1
#define _COG1ASD_G1ASDSC1_LENGTH                            0x1
#define _COG1ASD_G1ASDSC1_MASK                              0x2
#define _COG1ASD_G1ASDSC2_POSN                              0x2
#define _COG1ASD_G1ASDSC2_POSITION                          0x2
#define _COG1ASD_G1ASDSC2_SIZE                              0x1
#define _COG1ASD_G1ASDSC2_LENGTH                            0x1
#define _COG1ASD_G1ASDSC2_MASK                              0x4
#define _COG1ASD_G1ASDSHLT_POSN                             0x3
#define _COG1ASD_G1ASDSHLT_POSITION                         0x3
#define _COG1ASD_G1ASDSHLT_SIZE                             0x1
#define _COG1ASD_G1ASDSHLT_LENGTH                           0x1
#define _COG1ASD_G1ASDSHLT_MASK                             0x8
#define _COG1ASD_G1ASDL0_POSN                               0x4
#define _COG1ASD_G1ASDL0_POSITION                           0x4
#define _COG1ASD_G1ASDL0_SIZE                               0x1
#define _COG1ASD_G1ASDL0_LENGTH                             0x1
#define _COG1ASD_G1ASDL0_MASK                               0x10
#define _COG1ASD_G1ASDL1_POSN                               0x5
#define _COG1ASD_G1ASDL1_POSITION                           0x5
#define _COG1ASD_G1ASDL1_SIZE                               0x1
#define _COG1ASD_G1ASDL1_LENGTH                             0x1
#define _COG1ASD_G1ASDL1_MASK                               0x20
#define _COG1ASD_G1ARSEN_POSN                               0x6
#define _COG1ASD_G1ARSEN_POSITION                           0x6
#define _COG1ASD_G1ARSEN_SIZE                               0x1
#define _COG1ASD_G1ARSEN_LENGTH                             0x1
#define _COG1ASD_G1ARSEN_MASK                               0x40
#define _COG1ASD_G1ASDE_POSN                                0x7
#define _COG1ASD_G1ASDE_POSITION                            0x7
#define _COG1ASD_G1ASDE_SIZE                                0x1
#define _COG1ASD_G1ASDE_LENGTH                              0x1
#define _COG1ASD_G1ASDE_MASK                                0x80

