MikroElektronika/core_packages/PIC/XC8/def/PIC12F752/mcu.h
/*
 * Bit Definitions
 */
#define _DEPRECATED __attribute__((__deprecated__))
#ifndef BANKMASK
#define BANKMASK(addr) ((addr)&07Fh)
#endif
#define _BIT_ACCESS(r,b) ___mkstr(BANKMASK(r)) "," ___mkstr(b)
#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr)&07FFh)
#endif
// ADCON1<ADCS0>
extern volatile __bit                   ADCS0               __at(0xFC);	// @ (0x1F * 8 + 4)
#define                                 ADCS0_bit           _BIT_ACCESS(ADCON1,4)
// ADCON1<ADCS1>
extern volatile __bit                   ADCS1               __at(0xFD);	// @ (0x1F * 8 + 5)
#define                                 ADCS1_bit           _BIT_ACCESS(ADCON1,5)
// ADCON1<ADCS2>
extern volatile __bit                   ADCS2               __at(0xFE);	// @ (0x1F * 8 + 6)
#define                                 ADCS2_bit           _BIT_ACCESS(ADCON1,6)
// ADCON0<ADFM>
extern volatile __bit                   ADFM                __at(0xF7);	// @ (0x1E * 8 + 7)
#define                                 ADFM_bit            _BIT_ACCESS(ADCON0,7)
// PIE1<ADIE>
extern volatile __bit                   ADIE                __at(0x466);	// @ (0x8C * 8 + 6)
#define                                 ADIE_bit            _BIT_ACCESS(PIE1,6)
// PIR1<ADIF>
extern volatile __bit                   ADIF                __at(0x66);	// @ (0xC * 8 + 6)
#define                                 ADIF_bit            _BIT_ACCESS(PIR1,6)
// ADCON0<ADON>
extern volatile __bit                   ADON                __at(0xF0);	// @ (0x1E * 8 + 0)
#define                                 ADON_bit            _BIT_ACCESS(ADCON0,0)
// ANSELA<ANSA0>
extern volatile __bit                   ANSA0               __at(0xC28);	// @ (0x185 * 8 + 0)
#define                                 ANSA0_bit           _BIT_ACCESS(ANSELA,0)
// ANSELA<ANSA1>
extern volatile __bit                   ANSA1               __at(0xC29);	// @ (0x185 * 8 + 1)
#define                                 ANSA1_bit           _BIT_ACCESS(ANSELA,1)
// ANSELA<ANSA2>
extern volatile __bit                   ANSA2               __at(0xC2A);	// @ (0x185 * 8 + 2)
#define                                 ANSA2_bit           _BIT_ACCESS(ANSELA,2)
// ANSELA<ANSA4>
extern volatile __bit                   ANSA4               __at(0xC2C);	// @ (0x185 * 8 + 4)
#define                                 ANSA4_bit           _BIT_ACCESS(ANSELA,4)
// ANSELA<ANSA5>
extern volatile __bit                   ANSA5               __at(0xC2D);	// @ (0x185 * 8 + 5)
#define                                 ANSA5_bit           _BIT_ACCESS(ANSELA,5)
// CM1CON0<C1HYS>
extern volatile __bit                   C1HYS               __at(0x4E9);	// @ (0x9D * 8 + 1)
#define                                 C1HYS_bit           _BIT_ACCESS(CM1CON0,1)
// PIE2<C1IE>
extern volatile __bit                   C1IE                __at(0x46C);	// @ (0x8D * 8 + 4)
#define                                 C1IE_bit            _BIT_ACCESS(PIE2,4)
// PIR2<C1IF>
extern volatile __bit                   C1IF                __at(0x6C);	// @ (0xD * 8 + 4)
#define                                 C1IF_bit            _BIT_ACCESS(PIR2,4)
// CM1CON1<C1INTN>
extern volatile __bit                   C1INTN              __at(0x4F6);	// @ (0x9E * 8 + 6)
#define                                 C1INTN_bit          _BIT_ACCESS(CM1CON1,6)
// CM1CON1<C1INTP>
extern volatile __bit                   C1INTP              __at(0x4F7);	// @ (0x9E * 8 + 7)
#define                                 C1INTP_bit          _BIT_ACCESS(CM1CON1,7)
// CM1CON1<C1NCH0>
extern volatile __bit                   C1NCH0              __at(0x4F0);	// @ (0x9E * 8 + 0)
#define                                 C1NCH0_bit          _BIT_ACCESS(CM1CON1,0)
// CM1CON0<C1OE>
extern volatile __bit                   C1OE                __at(0x4ED);	// @ (0x9D * 8 + 5)
#define                                 C1OE_bit            _BIT_ACCESS(CM1CON0,5)
// CM1CON0<C1ON>
extern volatile __bit                   C1ON                __at(0x4EF);	// @ (0x9D * 8 + 7)
#define                                 C1ON_bit            _BIT_ACCESS(CM1CON0,7)
// CM1CON0<C1OUT>
extern volatile __bit                   C1OUT               __at(0x4EE);	// @ (0x9D * 8 + 6)
#define                                 C1OUT_bit           _BIT_ACCESS(CM1CON0,6)
// CM1CON1<C1PCH0>
extern volatile __bit                   C1PCH0              __at(0x4F4);	// @ (0x9E * 8 + 4)
#define                                 C1PCH0_bit          _BIT_ACCESS(CM1CON1,4)
// CM1CON1<C1PCH1>
extern volatile __bit                   C1PCH1              __at(0x4F5);	// @ (0x9E * 8 + 5)
#define                                 C1PCH1_bit          _BIT_ACCESS(CM1CON1,5)
// CM1CON0<C1POL>
extern volatile __bit                   C1POL               __at(0x4EC);	// @ (0x9D * 8 + 4)
#define                                 C1POL_bit           _BIT_ACCESS(CM1CON0,4)
// CM1CON0<C1SP>
extern volatile __bit                   C1SP                __at(0x4EA);	// @ (0x9D * 8 + 2)
#define                                 C1SP_bit            _BIT_ACCESS(CM1CON0,2)
// CM1CON0<C1SYNC>
extern volatile __bit                   C1SYNC              __at(0x4E8);	// @ (0x9D * 8 + 0)
#define                                 C1SYNC_bit          _BIT_ACCESS(CM1CON0,0)
// CM1CON0<C1ZLF>
extern volatile __bit                   C1ZLF               __at(0x4EB);	// @ (0x9D * 8 + 3)
#define                                 C1ZLF_bit           _BIT_ACCESS(CM1CON0,3)
// CM2CON0<C2HYS>
extern volatile __bit                   C2HYS               __at(0x4D9);	// @ (0x9B * 8 + 1)
#define                                 C2HYS_bit           _BIT_ACCESS(CM2CON0,1)
// PIE2<C2IE>
extern volatile __bit                   C2IE                __at(0x46D);	// @ (0x8D * 8 + 5)
#define                                 C2IE_bit            _BIT_ACCESS(PIE2,5)
// PIR2<C2IF>
extern volatile __bit                   C2IF                __at(0x6D);	// @ (0xD * 8 + 5)
#define                                 C2IF_bit            _BIT_ACCESS(PIR2,5)
// CM2CON1<C2INTN>
extern volatile __bit                   C2INTN              __at(0x4E6);	// @ (0x9C * 8 + 6)
#define                                 C2INTN_bit          _BIT_ACCESS(CM2CON1,6)
// CM2CON1<C2INTP>
extern volatile __bit                   C2INTP              __at(0x4E7);	// @ (0x9C * 8 + 7)
#define                                 C2INTP_bit          _BIT_ACCESS(CM2CON1,7)
// CM2CON1<C2NCH0>
extern volatile __bit                   C2NCH0              __at(0x4E0);	// @ (0x9C * 8 + 0)
#define                                 C2NCH0_bit          _BIT_ACCESS(CM2CON1,0)
// CM2CON0<C2OE>
extern volatile __bit                   C2OE                __at(0x4DD);	// @ (0x9B * 8 + 5)
#define                                 C2OE_bit            _BIT_ACCESS(CM2CON0,5)
// CM2CON0<C2ON>
extern volatile __bit                   C2ON                __at(0x4DF);	// @ (0x9B * 8 + 7)
#define                                 C2ON_bit            _BIT_ACCESS(CM2CON0,7)
// CM2CON0<C2OUT>
extern volatile __bit                   C2OUT               __at(0x4DE);	// @ (0x9B * 8 + 6)
#define                                 C2OUT_bit           _BIT_ACCESS(CM2CON0,6)
// CM2CON1<C2PCH0>
extern volatile __bit                   C2PCH0              __at(0x4E4);	// @ (0x9C * 8 + 4)
#define                                 C2PCH0_bit          _BIT_ACCESS(CM2CON1,4)
// CM2CON1<C2PCH1>
extern volatile __bit                   C2PCH1              __at(0x4E5);	// @ (0x9C * 8 + 5)
#define                                 C2PCH1_bit          _BIT_ACCESS(CM2CON1,5)
// CM2CON0<C2POL>
extern volatile __bit                   C2POL               __at(0x4DC);	// @ (0x9B * 8 + 4)
#define                                 C2POL_bit           _BIT_ACCESS(CM2CON0,4)
// CM2CON0<C2SP>
extern volatile __bit                   C2SP                __at(0x4DA);	// @ (0x9B * 8 + 2)
#define                                 C2SP_bit            _BIT_ACCESS(CM2CON0,2)
// CM2CON0<C2SYNC>
extern volatile __bit                   C2SYNC              __at(0x4D8);	// @ (0x9B * 8 + 0)
#define                                 C2SYNC_bit          _BIT_ACCESS(CM2CON0,0)
// CM2CON0<C2ZLF>
extern volatile __bit                   C2ZLF               __at(0x4DB);	// @ (0x9B * 8 + 3)
#define                                 C2ZLF_bit           _BIT_ACCESS(CM2CON0,3)
// STATUS<CARRY>
extern volatile __bit                   CARRY               __at(0x18);	// @ (0x3 * 8 + 0)
#define                                 CARRY_bit           _BIT_ACCESS(STATUS,0)
// PIE2<CCP1IE>
extern volatile __bit                   CCP1IE              __at(0x468);	// @ (0x8D * 8 + 0)
#define                                 CCP1IE_bit          _BIT_ACCESS(PIE2,0)
// PIR2<CCP1IF>
extern volatile __bit                   CCP1IF              __at(0x68);	// @ (0xD * 8 + 0)
#define                                 CCP1IF_bit          _BIT_ACCESS(PIR2,0)
// CCP1CON<CCP1M0>
extern volatile __bit                   CCP1M0              __at(0xA8);	// @ (0x15 * 8 + 0)
#define                                 CCP1M0_bit          _BIT_ACCESS(CCP1CON,0)
// CCP1CON<CCP1M1>
extern volatile __bit                   CCP1M1              __at(0xA9);	// @ (0x15 * 8 + 1)
#define                                 CCP1M1_bit          _BIT_ACCESS(CCP1CON,1)
// CCP1CON<CCP1M2>
extern volatile __bit                   CCP1M2              __at(0xAA);	// @ (0x15 * 8 + 2)
#define                                 CCP1M2_bit          _BIT_ACCESS(CCP1CON,2)
// CCP1CON<CCP1M3>
extern volatile __bit                   CCP1M3              __at(0xAB);	// @ (0x15 * 8 + 3)
#define                                 CCP1M3_bit          _BIT_ACCESS(CCP1CON,3)
// ADCON0<CHS0>
extern volatile __bit                   CHS0                __at(0xF2);	// @ (0x1E * 8 + 2)
#define                                 CHS0_bit            _BIT_ACCESS(ADCON0,2)
// ADCON0<CHS1>
extern volatile __bit                   CHS1                __at(0xF3);	// @ (0x1E * 8 + 3)
#define                                 CHS1_bit            _BIT_ACCESS(ADCON0,3)
// ADCON0<CHS2>
extern volatile __bit                   CHS2                __at(0xF4);	// @ (0x1E * 8 + 4)
#define                                 CHS2_bit            _BIT_ACCESS(ADCON0,4)
// ADCON0<CHS3>
extern volatile __bit                   CHS3                __at(0xF5);	// @ (0x1E * 8 + 5)
#define                                 CHS3_bit            _BIT_ACCESS(ADCON0,5)
// APFCON<COG1FSEL>
extern volatile __bit                   COG1FSEL            __at(0xC42);	// @ (0x188 * 8 + 2)
#define                                 COG1FSEL_bit        _BIT_ACCESS(APFCON,2)
// PIE2<COG1IE>
extern volatile __bit                   COG1IE              __at(0x46A);	// @ (0x8D * 8 + 2)
#define                                 COG1IE_bit          _BIT_ACCESS(PIE2,2)
// PIR2<COG1IF>
extern volatile __bit                   COG1IF              __at(0x6A);	// @ (0xD * 8 + 2)
#define                                 COG1IF_bit          _BIT_ACCESS(PIR2,2)
// APFCON<COG1O0SEL>
extern volatile __bit                   COG1O0SEL           __at(0xC40);	// @ (0x188 * 8 + 0)
#define                                 COG1O0SEL_bit       _BIT_ACCESS(APFCON,0)
// APFCON<COG1O1SEL>
extern volatile __bit                   COG1O1SEL           __at(0xC41);	// @ (0x188 * 8 + 1)
#define                                 COG1O1SEL_bit       _BIT_ACCESS(APFCON,1)
// DACCON0<DACEN>
extern volatile __bit                   DACEN               __at(0x48F);	// @ (0x91 * 8 + 7)
#define                                 DACEN_bit           _BIT_ACCESS(DACCON0,7)
// DACCON0<DACOE>
extern volatile __bit                   DACOE               __at(0x48D);	// @ (0x91 * 8 + 5)
#define                                 DACOE_bit           _BIT_ACCESS(DACCON0,5)
// DACCON0<DACPSS0>
extern volatile __bit                   DACPSS0             __at(0x48A);	// @ (0x91 * 8 + 2)
#define                                 DACPSS0_bit         _BIT_ACCESS(DACCON0,2)
// DACCON1<DACR0>
extern volatile __bit                   DACR0               __at(0x490);	// @ (0x92 * 8 + 0)
#define                                 DACR0_bit           _BIT_ACCESS(DACCON1,0)
// DACCON1<DACR1>
extern volatile __bit                   DACR1               __at(0x491);	// @ (0x92 * 8 + 1)
#define                                 DACR1_bit           _BIT_ACCESS(DACCON1,1)
// DACCON1<DACR2>
extern volatile __bit                   DACR2               __at(0x492);	// @ (0x92 * 8 + 2)
#define                                 DACR2_bit           _BIT_ACCESS(DACCON1,2)
// DACCON1<DACR3>
extern volatile __bit                   DACR3               __at(0x493);	// @ (0x92 * 8 + 3)
#define                                 DACR3_bit           _BIT_ACCESS(DACCON1,3)
// DACCON1<DACR4>
extern volatile __bit                   DACR4               __at(0x494);	// @ (0x92 * 8 + 4)
#define                                 DACR4_bit           _BIT_ACCESS(DACCON1,4)
// DACCON0<DACRNG>
extern volatile __bit                   DACRNG              __at(0x48E);	// @ (0x91 * 8 + 6)
#define                                 DACRNG_bit          _BIT_ACCESS(DACCON0,6)
// STATUS<DC>
extern volatile __bit                   DC                  __at(0x19);	// @ (0x3 * 8 + 1)
#define                                 DC_bit              _BIT_ACCESS(STATUS,1)
// CCP1CON<DC1B0>
extern volatile __bit                   DC1B0               __at(0xAC);	// @ (0x15 * 8 + 4)
#define                                 DC1B0_bit           _BIT_ACCESS(CCP1CON,4)
// CCP1CON<DC1B1>
extern volatile __bit                   DC1B1               __at(0xAD);	// @ (0x15 * 8 + 5)
#define                                 DC1B1_bit           _BIT_ACCESS(CCP1CON,5)
// FVRCON<FVRBUFEN>
extern volatile __bit                   FVRBUFEN            __at(0x485);	// @ (0x90 * 8 + 5)
#define                                 FVRBUFEN_bit        _BIT_ACCESS(FVRCON,5)
// FVRCON<FVRBUFSS>
extern volatile __bit                   FVRBUFSS            __at(0x484);	// @ (0x90 * 8 + 4)
#define                                 FVRBUFSS_bit        _BIT_ACCESS(FVRCON,4)
// FVRCON<FVREN>
extern volatile __bit                   FVREN               __at(0x487);	// @ (0x90 * 8 + 7)
#define                                 FVREN_bit           _BIT_ACCESS(FVRCON,7)
// FVRCON<FVRRDY>
extern volatile __bit                   FVRRDY              __at(0x486);	// @ (0x90 * 8 + 6)
#define                                 FVRRDY_bit          _BIT_ACCESS(FVRCON,6)
// COG1ASD<G1ARSEN>
extern volatile __bit                   G1ARSEN             __at(0xCBE);	// @ (0x197 * 8 + 6)
#define                                 G1ARSEN_bit         _BIT_ACCESS(COG1ASD,6)
// COG1ASD<G1ASDE>
extern volatile __bit                   G1ASDE              __at(0xCBF);	// @ (0x197 * 8 + 7)
#define                                 G1ASDE_bit          _BIT_ACCESS(COG1ASD,7)
// COG1ASD<G1ASDL0>
extern volatile __bit                   G1ASDL0             __at(0xCBC);	// @ (0x197 * 8 + 4)
#define                                 G1ASDL0_bit         _BIT_ACCESS(COG1ASD,4)
// COG1ASD<G1ASDL1>
extern volatile __bit                   G1ASDL1             __at(0xCBD);	// @ (0x197 * 8 + 5)
#define                                 G1ASDL1_bit         _BIT_ACCESS(COG1ASD,5)
// COG1ASD<G1ASDSC1>
extern volatile __bit                   G1ASDSC1            __at(0xCB9);	// @ (0x197 * 8 + 1)
#define                                 G1ASDSC1_bit        _BIT_ACCESS(COG1ASD,1)
// COG1ASD<G1ASDSC2>
extern volatile __bit                   G1ASDSC2            __at(0xCBA);	// @ (0x197 * 8 + 2)
#define                                 G1ASDSC2_bit        _BIT_ACCESS(COG1ASD,2)
// COG1ASD<G1ASDSFLT>
extern volatile __bit                   G1ASDSFLT           __at(0xCB8);	// @ (0x197 * 8 + 0)
#define                                 G1ASDSFLT_bit       _BIT_ACCESS(COG1ASD,0)
// COG1ASD<G1ASDSHLT>
extern volatile __bit                   G1ASDSHLT           __at(0xCBB);	// @ (0x197 * 8 + 3)
#define                                 G1ASDSHLT_bit       _BIT_ACCESS(COG1ASD,3)
// COG1DB<G1BDR0>
extern volatile __bit                   G1BDR0              __at(0xCA4);	// @ (0x194 * 8 + 4)
#define                                 G1BDR0_bit          _BIT_ACCESS(COG1DB,4)
// COG1DB<G1BDR1>
extern volatile __bit                   G1BDR1              __at(0xCA5);	// @ (0x194 * 8 + 5)
#define                                 G1BDR1_bit          _BIT_ACCESS(COG1DB,5)
// COG1DB<G1BDR2>
extern volatile __bit                   G1BDR2              __at(0xCA6);	// @ (0x194 * 8 + 6)
#define                                 G1BDR2_bit          _BIT_ACCESS(COG1DB,6)
// COG1DB<G1BDR3>
extern volatile __bit                   G1BDR3              __at(0xCA7);	// @ (0x194 * 8 + 7)
#define                                 G1BDR3_bit          _BIT_ACCESS(COG1DB,7)
// COG1BLK<G1BLKF0>
extern volatile __bit                   G1BLKF0             __at(0xC98);	// @ (0x193 * 8 + 0)
#define                                 G1BLKF0_bit         _BIT_ACCESS(COG1BLK,0)
// COG1BLK<G1BLKF1>
extern volatile __bit                   G1BLKF1             __at(0xC99);	// @ (0x193 * 8 + 1)
#define                                 G1BLKF1_bit         _BIT_ACCESS(COG1BLK,1)
// COG1BLK<G1BLKF2>
extern volatile __bit                   G1BLKF2             __at(0xC9A);	// @ (0x193 * 8 + 2)
#define                                 G1BLKF2_bit         _BIT_ACCESS(COG1BLK,2)
// COG1BLK<G1BLKF3>
extern volatile __bit                   G1BLKF3             __at(0xC9B);	// @ (0x193 * 8 + 3)
#define                                 G1BLKF3_bit         _BIT_ACCESS(COG1BLK,3)
// COG1BLK<G1BLKR0>
extern volatile __bit                   G1BLKR0             __at(0xC9C);	// @ (0x193 * 8 + 4)
#define                                 G1BLKR0_bit         _BIT_ACCESS(COG1BLK,4)
// COG1BLK<G1BLKR1>
extern volatile __bit                   G1BLKR1             __at(0xC9D);	// @ (0x193 * 8 + 5)
#define                                 G1BLKR1_bit         _BIT_ACCESS(COG1BLK,5)
// COG1BLK<G1BLKR2>
extern volatile __bit                   G1BLKR2             __at(0xC9E);	// @ (0x193 * 8 + 6)
#define                                 G1BLKR2_bit         _BIT_ACCESS(COG1BLK,6)
// COG1BLK<G1BLKR3>
extern volatile __bit                   G1BLKR3             __at(0xC9F);	// @ (0x193 * 8 + 7)
#define                                 G1BLKR3_bit         _BIT_ACCESS(COG1BLK,7)
// COG1CON0<G1CS0>
extern volatile __bit                   G1CS0               __at(0xCA8);	// @ (0x195 * 8 + 0)
#define                                 G1CS0_bit           _BIT_ACCESS(COG1CON0,0)
// COG1CON0<G1CS1>
extern volatile __bit                   G1CS1               __at(0xCA9);	// @ (0x195 * 8 + 1)
#define                                 G1CS1_bit           _BIT_ACCESS(COG1CON0,1)
// COG1DB<G1DBF0>
extern volatile __bit                   G1DBF0              __at(0xCA0);	// @ (0x194 * 8 + 0)
#define                                 G1DBF0_bit          _BIT_ACCESS(COG1DB,0)
// COG1DB<G1DBF1>
extern volatile __bit                   G1DBF1              __at(0xCA1);	// @ (0x194 * 8 + 1)
#define                                 G1DBF1_bit          _BIT_ACCESS(COG1DB,1)
// COG1DB<G1DBF2>
extern volatile __bit                   G1DBF2              __at(0xCA2);	// @ (0x194 * 8 + 2)
#define                                 G1DBF2_bit          _BIT_ACCESS(COG1DB,2)
// COG1DB<G1DBF3>
extern volatile __bit                   G1DBF3              __at(0xCA3);	// @ (0x194 * 8 + 3)
#define                                 G1DBF3_bit          _BIT_ACCESS(COG1DB,3)
// COG1CON0<G1EN>
extern volatile __bit                   G1EN                __at(0xCAF);	// @ (0x195 * 8 + 7)
#define                                 G1EN_bit            _BIT_ACCESS(COG1CON0,7)
// COG1CON1<G1FS0>
extern volatile __bit                   G1FS0               __at(0xCB3);	// @ (0x196 * 8 + 3)
#define                                 G1FS0_bit           _BIT_ACCESS(COG1CON1,3)
// COG1CON1<G1FS1>
extern volatile __bit                   G1FS1               __at(0xCB4);	// @ (0x196 * 8 + 4)
#define                                 G1FS1_bit           _BIT_ACCESS(COG1CON1,4)
// COG1CON1<G1FS2>
extern volatile __bit                   G1FS2               __at(0xCB5);	// @ (0x196 * 8 + 5)
#define                                 G1FS2_bit           _BIT_ACCESS(COG1CON1,5)
// COG1CON1<G1FSIM>
extern volatile __bit                   G1FSIM              __at(0xCB7);	// @ (0x196 * 8 + 7)
#define                                 G1FSIM_bit          _BIT_ACCESS(COG1CON1,7)
// COG1CON0<G1LD>
extern volatile __bit                   G1LD                __at(0xCAA);	// @ (0x195 * 8 + 2)
#define                                 G1LD_bit            _BIT_ACCESS(COG1CON0,2)
// COG1CON0<G1OE0>
extern volatile __bit                   G1OE0               __at(0xCAD);	// @ (0x195 * 8 + 5)
#define                                 G1OE0_bit           _BIT_ACCESS(COG1CON0,5)
// COG1CON0<G1OE1>
extern volatile __bit                   G1OE1               __at(0xCAE);	// @ (0x195 * 8 + 6)
#define                                 G1OE1_bit           _BIT_ACCESS(COG1CON0,6)
// COG1PH<G1PH0>
extern volatile __bit                   G1PH0               __at(0xC90);	// @ (0x192 * 8 + 0)
#define                                 G1PH0_bit           _BIT_ACCESS(COG1PH,0)
// COG1PH<G1PH1>
extern volatile __bit                   G1PH1               __at(0xC91);	// @ (0x192 * 8 + 1)
#define                                 G1PH1_bit           _BIT_ACCESS(COG1PH,1)
// COG1PH<G1PH2>
extern volatile __bit                   G1PH2               __at(0xC92);	// @ (0x192 * 8 + 2)
#define                                 G1PH2_bit           _BIT_ACCESS(COG1PH,2)
// COG1PH<G1PH3>
extern volatile __bit                   G1PH3               __at(0xC93);	// @ (0x192 * 8 + 3)
#define                                 G1PH3_bit           _BIT_ACCESS(COG1PH,3)
// COG1CON0<G1POL0>
extern volatile __bit                   G1POL0              __at(0xCAB);	// @ (0x195 * 8 + 3)
#define                                 G1POL0_bit          _BIT_ACCESS(COG1CON0,3)
// COG1CON0<G1POL1>
extern volatile __bit                   G1POL1              __at(0xCAC);	// @ (0x195 * 8 + 4)
#define                                 G1POL1_bit          _BIT_ACCESS(COG1CON0,4)
// COG1CON1<G1RS0>
extern volatile __bit                   G1RS0               __at(0xCB0);	// @ (0x196 * 8 + 0)
#define                                 G1RS0_bit           _BIT_ACCESS(COG1CON1,0)
// COG1CON1<G1RS1>
extern volatile __bit                   G1RS1               __at(0xCB1);	// @ (0x196 * 8 + 1)
#define                                 G1RS1_bit           _BIT_ACCESS(COG1CON1,1)
// COG1CON1<G1RS2>
extern volatile __bit                   G1RS2               __at(0xCB2);	// @ (0x196 * 8 + 2)
#define                                 G1RS2_bit           _BIT_ACCESS(COG1CON1,2)
// COG1CON1<G1RSIM>
extern volatile __bit                   G1RSIM              __at(0xCB6);	// @ (0x196 * 8 + 6)
#define                                 G1RSIM_bit          _BIT_ACCESS(COG1CON1,6)
// INTCON<GIE>
extern volatile __bit                   GIE                 __at(0x5F);	// @ (0xB * 8 + 7)
#define                                 GIE_bit             _BIT_ACCESS(INTCON,7)
// ADCON0<GO_nDONE>
extern volatile __bit                   GO_nDONE            __at(0xF1);	// @ (0x1E * 8 + 1)
#define                                 GO_nDONE_bit        _BIT_ACCESS(ADCON0,1)
// HLT1CON0<H1CKPS0>
extern volatile __bit                   H1CKPS0             __at(0x8A8);	// @ (0x115 * 8 + 0)
#define                                 H1CKPS0_bit         _BIT_ACCESS(HLT1CON0,0)
// HLT1CON0<H1CKPS1>
extern volatile __bit                   H1CKPS1             __at(0x8A9);	// @ (0x115 * 8 + 1)
#define                                 H1CKPS1_bit         _BIT_ACCESS(HLT1CON0,1)
// HLT1CON1<H1ERS0>
